build/docs/realization-plan/ssad-2017-monsoon-plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Plan for Merge sort experiment</title>
<!-- 2019-04-09 Tue 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/bootstrap.mini.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/labtheme.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Plan for Merge sort experiment</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Merge sort experiment 3</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In the 3rd version we will use dagre-d3.js a library based
on d3 itself.
</li>
<li>The tree would be generated using dagre.
</li>
<li>The split nodes will be generated using the binary logic
of having children of index i as 2*i+1 and 2*i+2.
</li>
<li>After everything is splitted then merging will begin.
</li>
<li>Merge function will be modified to accomodate formation of
nodes.
</li>
<li>All the ID's will be mapped so as to obtain the data each
node represents anytime.
</li>
<li>Then merging of nodes would be done.
</li>
<li>No definite logic is there so would go for hard coding
i.e. brute force for merge.
</li>
<li>Will look for logic for merging as time passes by.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Problems faced while implementing</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Problem in generating splits on button clicks.
<ul class="org-ul">
<li>This can be done using the row numbers as the nodes are
marked using binary logic.
</li>
<li>Just use the row number and generate all the nodes that
can be there in this row and see if they exist using the
visited array.
</li>
<li>Draw edges accordingly.
</li>
<li>But use the graph as a local variable then as the global
cannot be altered again and again - solution: a reset
function for resetting all the local variables.
</li>
<li>No definite logic for merging was found so had to hard
code i.e. use brute force for merge.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Winter Intern</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Objectives</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Objective1:</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Make a tutorial of MergeSort experiment with
interactive exercises for the users etc.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Objective2:</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Add detail explaination of time complexity of MergeSort
algorithm to the tutorial.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Plan:</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Plan for Objective1:</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Using routes to display the templates.
</li>
<li>The tutorial for mergesort involves 7 templates.
</li>
</ul>
</div>
<ul class="org-ul"><li><a id="sec-3-2-1-1" name="sec-3-2-1-1"></a>1st template:<br  /><div class="outline-text-5" id="text-3-2-1-1">
<ul class="org-ul">
<li>Introduction and discussion of steps involved in
MergeSort algorithm.
</li>
<li>The next templates focus on explaination of subparts
of Mergesort algorithm.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-2" name="sec-3-2-1-2"></a>2nd template:<br  /><div class="outline-text-5" id="text-3-2-1-2">
<ul class="org-ul">
<li>Explaination of split of Mergesort algorithm.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-3" name="sec-3-2-1-3"></a>3rd template:<br  /><div class="outline-text-5" id="text-3-2-1-3">
<ul class="org-ul">
<li>An interactive exercise on split of MergeSort
algorithm.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-4" name="sec-3-2-1-4"></a>4th template:<br  /><div class="outline-text-5" id="text-3-2-1-4">
<ul class="org-ul">
<li>This template explains the merge (subpart of
MergeSort).
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-5" name="sec-3-2-1-5"></a>5th template:<br  /><div class="outline-text-5" id="text-3-2-1-5">
<ul class="org-ul">
<li>The fifth template provides an interactive exercise on
merge.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-6" name="sec-3-2-1-6"></a>6th template:<br  /><div class="outline-text-5" id="text-3-2-1-6">
<ul class="org-ul">
<li>The sixth template demonstrates the basic mergesort by
asking the user to give an input array.
</li>
<li>When the user enters an array and clicks on the 'sort'
button, then mergesort graph is displayed.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-1-7" name="sec-3-2-1-7"></a>7th template:<br  /><div class="outline-text-5" id="text-3-2-1-7">
<ul class="org-ul">
<li>The seventh template provides an interactive exercise
for mergesort algorithm.
</li>
<li>It allows the user to move to the next slide only if
has completed correctly the exercise.
</li>
<li>The user will be provided a check button to check his
answer.
</li>
<li>The check informs the user whether is answer is
correct or not.
</li>
</ul>
</div>
</li></ul>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">Plan for Objective2:</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>The time complexity demonstration involves 7 templates.
</li>
</ul>
</div>
<ul class="org-ul"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>8th template:<br  /><div class="outline-text-5" id="text-3-2-2-1">
<ul class="org-ul">
<li>Derive and explain the time complexity equation for
mergesort algorithm.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-2" name="sec-3-2-2-2"></a>9th template:<br  /><div class="outline-text-5" id="text-3-2-2-2">
<ul class="org-ul">
<li>Derive the time complexity for split subpart of
mergesort algorithm.
</li>
<li>Calculate the order of computation of split for a
general array of size 'n'.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-3" name="sec-3-2-2-3"></a>10th template:<br  /><div class="outline-text-5" id="text-3-2-2-3">
<ul class="org-ul">
<li>Derive the time complexity for merge subpart of
mergesort algorithm.
</li>
<li>Calculate the order of computation of merge for a
general array of size 'n'.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-4" name="sec-3-2-2-4"></a>11th template:<br  /><div class="outline-text-5" id="text-3-2-2-4">
<ul class="org-ul">
<li>Derive the order of time complexity of mergesort
algorithm.
</li>
<li>In this template time complexity of mergesort
algorithm is derived by using the time complexity of
split and merge subparts.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-5" name="sec-3-2-2-5"></a>12th template:<br  /><div class="outline-text-5" id="text-3-2-2-5">
<ul class="org-ul">
<li>Calculate the time required for computation of
mergesort time for some array.
</li>
<li>Prove that the calculated value using formula and the
computed value using the mergesort graph are the same.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-6" name="sec-3-2-2-6"></a>13th template:<br  /><div class="outline-text-5" id="text-3-2-2-6">
<ul class="org-ul">
<li>Plot the graph of complexity of mergesort against 'n'.
</li>
<li>Explain the variation of mergesort complexity with no
of elements.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-7" name="sec-3-2-2-7"></a>14th template:<br  /><div class="outline-text-5" id="text-3-2-2-7">
<ul class="org-ul">
<li>Plot of various sorting algorithms in one graph.
</li>
<li>Explain why mergesort is more efficient than other
sorting algorithms.
</li>
</ul>
</div>
</li></ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: [2016-07-1 Sat]</p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2019-04-09 Tue 14:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
